<a href="https://colab.research.google.com/github/annefinger/data_science/blob/master/trees_sample.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## DataFrames a partir de Dicionários

Uma das estruturas básicas do Python é o Dicionário. É muito conveniente informarmos nossos dados em uma variável do tipo 'dict', pois sua conversão em *DataFrame* é muito simples e direta.

In [1]:
#importar pandas
import pandas as pd

In [3]:
#criar Dicionário
dados = { 'espécie': ['plátano', 'araucária', 'eucalipto', 'pinus'],
          'altura (m)': ['18', '25', '28', '22'],
          'diâmetro (cm)': ['30', '40', '35', '36'],
          'ataque por pragas': [ True, True, False, False] }

In [5]:
#criar DataFrame
df = pd.DataFrame (dados)

In [7]:
#visualizar DataFrame
df

     espécie altura (m) diâmetro (cm)  ataque por pragas
0    plátano         18            30               True
1  araucária         25            40               True
2  eucalipto         28            35              False
3      pinus         22            36              False

In [10]:
#trocar ID do usuário
id_usuario = [30, 150, 45, 17]

In [11]:
#associar ID à lista
df.index = id_usuario

In [12]:
#visualizar DataFrame
display(df)

       espécie altura (m) diâmetro (cm)  ataque por pragas
30     plátano         18            30               True
150  araucária         25            40               True
45   eucalipto         28            35              False
17       pinus         22            36              False

## DataFrames a partir de Listas 

Listas também são estruturas muito usadas em Python, e não é incomum termos que criar *DataFrame* a partir destas.

Para organizar nossas várias listas de um modo que seja fácil sua conversão em *DataFrame*, vou utilizar a função *built-in* `zip()`.

In [15]:
#listas

dados = [['plátano', 18, 30, 'True'],
         ['araucária', 25, 40, 'True'],
         ['eucalipto', 28, 35, 'False'],
         ['pinus', 22, 36, 'False']]

#DataFrame

df = pd.DataFrame (dados, columns = ['espécie', 'altura (m)', 'diâmetro (cm)', 'ataque por pragas'],
                   index = [30, 150, 45, 17])
df

       espécie  altura (m)  diâmetro (cm) ataque por pragas
30     plátano          18             30              True
150  araucária          25             40              True
45   eucalipto          28             35             False
17       pinus          22             36             False

In [16]:
#selecionar pelo index

df.loc[150]

espécie              araucária
altura (m)                  25
diâmetro (cm)               40
ataque por pragas         True
Name: 150, dtype: object

In [17]:
#criar nova coluna

df['mortas']=0
df

       espécie  altura (m)  diâmetro (cm) ataque por pragas  mortas
30     plátano          18             30              True       0
150  araucária          25             40              True       0
45   eucalipto          28             35             False       0
17       pinus          22             36             False       0

##Modificar *index* e colunas

As vezes, precisamos alterar o nome dos índices ou o *label* das colunas. Se você olhar na célula acima, veja que na esquerda do *DataFrame* o index de cada linha é representado por um número entre 0 e 3.

É possível alterar esse atributo da variável acessando diretamente assim:

In [18]:
df.index

Int64Index([30, 150, 45, 17], dtype='int64')

In [19]:
#alterar o index do df

df.index = ['a', 'b', 'c', 'd']
df

     espécie  altura (m)  diâmetro (cm) ataque por pragas  mortas
a    plátano          18             30              True       0
b  araucária          25             40              True       0
c  eucalipto          28             35             False       0
d      pinus          22             36             False       0

Da mesma maneira, se eu precisar alterar o nome das colunas, posso alterar diretamente no atributo da variável.

In [20]:
#alterar o labels das colunas

df.columns = ['nome comum', 'altura (m)', 'diâmetro (cm)', 'ataque por pragas', 'mortas']
df

  nome comum  altura (m)  diâmetro (cm) ataque por pragas  mortas
a    plátano          18             30              True       0
b  araucária          25             40              True       0
c  eucalipto          28             35             False       0
d      pinus          22             36             False       0